
Процедура Tест()

    Параметры = СведенияОбОбновлении();
    ФиксированныйМассив = ОбщегоНазначения.ФиксированныеДанные(Параметры);
    // Часть кода для документации
    Для каждого Элемент из ФиксированныйМассив Цикл
        Если Элемент.ОбновлениеДоступно ИЛИ Элемент.Наименование = "Значение1" Тогда
             // Продолжаем...
        КонецЕсли
    КонецЦикла;

КонецПроцедуры

// Сведения об обновлении.
// 
// Возвращаемое значение:
//  Массив из Структура:
//   * Наименование - Строка - описание,
//   * ОбновлениеДоступно - Булево - описание.
//
Функция СведенияОбОбновлении()
    Массив = Новый Массив();
    Массив.Добавить(Новый Структура("Наименование, ОбновлениеДоступно", "Значение1", Истина));
    Возврат Массив;
КонецФункции
