
&НаСервере
Процедура Тест_ПараметрыПоУмолчанию() экспорт
	
	Значение = Новый Структура("Ключ1", "Строка");
	ЗначениеПослеКопирования = ОбщегоНазначения.СкопироватьРекурсивно(Значение);
	
Конецпроцедуры

&НаСервере
Процедура Тест_ПараметрыПервыйПараметрУстановленВЗначениеПоУмолчанию() экспорт
    
    Значение = Новый Структура("Ключ1", "Строка");
    ЗначениеПослеКопирования = ОбщегоНазначения.СкопироватьРекурсивно(Значение, Ложь);
    
Конецпроцедуры

&НаСервере
Процедура Тест_ВозвратФиксированнойСтруктуры() экспорт
    
    Значение = Новый Структура("Ключ1", "Строка");
    ЗначениеПослеКопирования = ОбщегоНазначения.СкопироватьРекурсивно(Значение, Истина);
    
Конецпроцедуры

&НаСервере
Процедура Тест_ВозвратФиксированногоСоответствия() экспорт
    
    Значение = Новый Соответствие();
    Значение.Вставить(1, Новый Структура("Ключ1", "Значение"));
    ЗначениеПослеКопирования = ОбщегоНазначения.СкопироватьРекурсивно(Значение, Истина);
    
Конецпроцедуры

&НаСервере
Процедура Тест_ВозвратФиксированногоМассив() экспорт
    
    Значение = Новый Массив; // Массив Из Структура
    ЗначениеПослеКопирования = ОбщегоНазначения.СкопироватьРекурсивно(Значение, Истина);
    
Конецпроцедуры

&НаСервере
Процедура Тест_ВозвратСписка() экспорт
    
    Значение = Новый СписокЗначений();
    Значение.Вставить(1);
    ЗначениеПослеКопирования = ОбщегоНазначения.СкопироватьРекурсивно(Значение, Истина);
    
Конецпроцедуры