#Если Сервер Тогда

// Параметры:
//  Ссылка - СправочникСсылка.Товары - 
Процедура Тест(Ссылка) экспорт
	
	ИмяРеквзита = "Поставщик";
	ИменаРеквизитов = Новый Массив("Родитель");
	ИменаРеквизитов.Добавить(ИмяРеквзита);
	ИменаРеквизитов.Добавить();
	ИменаРеквизитов.Добавить("Ссылка");
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, ИменаРеквизитов);
	
	ЕстьСвойство = Результат.Свойство("Поставщик"); // Тут тип возврата расчитывается
	
	Если Результат.Свойство("Поставщик")  Тогда // тут контент-ассист не подсказывает методы структуры
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

